shared/performance-tests/results/item_by_concept.txt
# 5분간 300명

## API 0
     ✗ API 0: status was 200
      ↳  99% — ✓ 476835 / ✗ 176
     ✗ API 0: response time < 500ms
      ↳  99% — ✓ 476594 / ✗ 417

     checks.........................: 99.93% ✓ 953429      ✗ 593   
     data_received..................: 280 MB 907 kB/s
     data_sent......................: 65 MB  210 kB/s
     http_req_blocked...............: avg=1.59ms   min=0s        med=1.66µs   max=19.72s  p(90)=2.75µs   p(95)=3.7µs   
     http_req_connecting............: avg=1.59ms   min=0s        med=0s       max=19.72s  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=138.76ms min=0s        med=148.27ms max=1.01s   p(90)=211ms    p(95)=232.83ms
       { expected_response:true }...: avg=138.81ms min=721.58µs  med=148.29ms max=1.01s   p(90)=211.02ms p(95)=232.85ms
     http_req_failed................: 0.03%  ✓ 176         ✗ 476835
     http_req_receiving.............: avg=46.84µs  min=-345764ns med=33.83µs  max=31.79ms p(90)=72.33µs  p(95)=97.66µs 
     http_req_sending...............: avg=10.35µs  min=0s        med=7.5µs    max=12.44ms p(90)=13.7µs   p(95)=21.75µs 
     http_req_tls_handshaking.......: avg=0s       min=0s        med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=138.7ms  min=0s        med=148.21ms max=1.01s   p(90)=210.95ms p(95)=232.77ms
     http_reqs......................: 477011 1545.801354/s
     iteration_duration.............: avg=151.52ms min=743.62µs  med=148.42ms max=30.09s  p(90)=211.28ms p(95)=233.3ms 
     iterations.....................: 477011 1545.801354/s
     vus............................: 1      min=1         max=300 
     vus_max........................: 300    min=300       max=300 


## API 1
     ✗ API 1: status was 200
      ↳  99% — ✓ 562773 / ✗ 320
     ✗ API 1: response time < 500ms
      ↳  99% — ✓ 561066 / ✗ 2027

     checks.........................: 99.79% ✓ 1123839     ✗ 2347  
     data_received..................: 330 MB 1.0 MB/s
     data_sent......................: 74 MB  231 kB/s
     http_req_blocked...............: avg=1.52ms   min=0s        med=1.54µs   max=19.74s  p(90)=2.33µs   p(95)=3µs     
     http_req_connecting............: avg=1.51ms   min=0s        med=0s       max=19.74s  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=197.56ms min=0s        med=224.85ms max=1.23s   p(90)=285.12ms p(95)=333.69ms
       { expected_response:true }...: avg=197.67ms min=1.99ms    med=224.89ms max=1.23s   p(90)=285.16ms p(95)=333.73ms
     http_req_failed................: 0.05%  ✓ 320         ✗ 562773
     http_req_receiving.............: avg=48.86µs  min=-649264ns med=34.16µs  max=68.83ms p(90)=68.5µs   p(95)=109.41µs
     http_req_sending...............: avg=8.35µs   min=0s        med=7.25µs   max=6.96ms  p(90)=10.08µs  p(95)=13.55µs 
     http_req_tls_handshaking.......: avg=0s       min=0s        med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=197.5ms  min=0s        med=224.8ms  max=1.23s   p(90)=285.06ms p(95)=333.62ms
     http_reqs......................: 563093 1767.658373/s
     iteration_duration.............: avg=216.2ms  min=2.05ms    med=225.03ms max=30.01s  p(90)=285.69ms p(95)=334.65ms
     iterations.....................: 563093 1767.658373/s
     vus............................: 3      min=3         max=500 
     vus_max........................: 500    min=500       max=500 


## API 2
     ✗ API 2: status was 200
      ↳  99% — ✓ 1299785 / ✗ 3819
     ✗ API 2: response time < 500ms
      ↳  99% — ✓ 1302725 / ✗ 879

     checks.........................: 99.81%  ✓ 2602510     ✗ 4698   
     data_received..................: 787 MB  2.4 MB/s
     data_sent......................: 180 MB  551 kB/s
     http_req_blocked...............: avg=5.61ms  min=0s       med=541ns   max=19.8s   p(90)=1.7µs    p(95)=2.41µs  
     http_req_connecting............: avg=5.61ms  min=0s       med=0s      max=19.8s   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=53ms    min=0s       med=39.04ms max=1.69s   p(90)=114.71ms p(95)=152.63ms
       { expected_response:true }...: avg=53.06ms min=557.29µs med=39.11ms max=1.69s   p(90)=114.77ms p(95)=152.68ms
     http_req_failed................: 0.29%   ✓ 3819        ✗ 1299785
     http_req_receiving.............: avg=24.75µs min=0s       med=12.62µs max=56.2ms  p(90)=47.62µs  p(95)=76.25µs 
     http_req_sending...............: avg=4.27µs  min=0s       med=2.58µs  max=22.61ms p(90)=8.16µs   p(95)=10.7µs  
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=52.97ms min=0s       med=39.01ms max=1.69s   p(90)=114.68ms p(95)=152.6ms 
     http_reqs......................: 1303604 3995.400888/s
     iteration_duration.............: avg=95.96ms min=577.2µs  med=39.26ms max=30.12s  p(90)=115.65ms p(95)=154.65ms
     iterations.....................: 1303604 3995.400888/s
     vus............................: 2       min=2         max=500  
     vus_max........................: 500     min=500       max=500  


## API 3
     ✗ API 3: status was 200
      ↳  99% — ✓ 1381937 / ✗ 1364
     ✓ API 3: response time < 500ms

     checks.........................: 99.95%  ✓ 2765238     ✗ 1364   
     data_received..................: 811 MB  2.5 MB/s
     data_sent......................: 185 MB  569 kB/s
     http_req_blocked...............: avg=9.26ms  min=0s       med=667ns   max=19.75s   p(90)=2µs     p(95)=2.75µs 
     http_req_connecting............: avg=9.26ms  min=0s       med=0s      max=19.75s   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=15.55ms min=0s       med=9.61ms  max=278.53ms p(90)=42.47ms p(95)=50.02ms
       { expected_response:true }...: avg=15.57ms min=338.75µs med=9.63ms  max=278.53ms p(90)=42.48ms p(95)=50.03ms
     http_req_failed................: 0.09%   ✓ 1364        ✗ 1381937
     http_req_receiving.............: avg=25.16µs min=0s       med=14.91µs max=22.21ms  p(90)=48.7µs  p(95)=72.87µs
     http_req_sending...............: avg=4.94µs  min=0s       med=3.12µs  max=8.2ms    p(90)=9.12µs  p(95)=12.33µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=15.52ms min=0s       med=9.58ms  max=278.51ms p(90)=42.42ms p(95)=49.98ms
     http_reqs......................: 1383301 4246.497164/s
     iteration_duration.............: avg=54.44ms min=356.58µs med=9.72ms  max=30.01s   p(90)=42.83ms p(95)=50.4ms 
     iterations.....................: 1383301 4246.497164/s
     vus............................: 1       min=1         max=300  
     vus_max........................: 300     min=300       max=300